###########################################################
#	模块对应的测试.c程序命名以模块所在文件夹的名字命名！！
#
#
#
###########################################################

#########################config ###########################
CC = gcc
STRIP = strip
CFLAGS = -Wall -O2
DIR_EXE = ./exe


#########################config end########################

#########################TARGET ########################


test = test
TARGET = $(test)

#########################TARGET END########################






###########################src #############################
OBJ_MODS_T = $(test).c



###########################src end##########################

all: $(TARGET)
	@$(STRIP) $(TARGET)
	@mv $(TARGET) $(DIR_EXE)


$(TARGET): % : %.c
	$(CC) -o $@ $< 


.PHONY: sqlite clean test

clean:
	@rm $(DIR_EXE)/$(TARGET) #命令前面加@，在执行时命令就不会输出到屏幕上
###########################rules end##########################

